{
  "jobs": [
    {
      "id": "1",
      "title": "Senior React Developer",
      "type": "Full-Time",
      "description": "Lead front-end development with React: design and implement reusable component libraries, improve application architecture, and collaborate closely with designers and backend engineers to deliver performant, accessible user experiences. You will mentor junior engineers, set coding standards, and help drive technical decisions that impact the UI layer across multiple products.",
      "location": "Austin, Texas",
      "salary": "$125K - $150K",
      "company": {
        "name": "NewTek Solutions",
        "description": "NewTek Solutions builds web apps and digital experiences for enterprise clients.",
        "contactEmail": "contact@teksolutions.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "2",
      "title": "Junior Frontend Engineer",
      "type": "Internship",
      "description": "Join the team as a hands-on learner: implement UI features, write tests, and learn best practices in React and modern CSS. This role is ideal for someone looking to grow quickly while contributing to customer-facing features and internal tools.",
      "location": "Remote",
      "salary": "Under $50K",
      "company": {
        "name": "BrightStart Labs",
        "description": "A small startup focused on developer tools and education.",
        "contactEmail": "hello@brightstart.io",
        "contactPhone": "555-111-2222"
      }
    },
    {
      "id": "3",
      "title": "Full Stack Developer (React/Node)",
      "type": "Full-Time",
      "description": "Build and maintain web services and front-end UI, implement robust REST APIs, and deploy services to cloud infrastructure. You will work across the stack — from database schema design to client-side performance optimizations — and help improve developer tooling and CI/CD workflows.",
      "location": "San Francisco, CA",
      "salary": "$60K - $70K",
      "company": {
        "name": "CloudWave Inc.",
        "description": "CloudWave provides cloud-native solutions for scale-ups.",
        "contactEmail": "jobs@cloudwave.com",
        "contactPhone": "555-222-3333"
      }
    },
    {
      "id": "4",
      "title": "UI/UX Engineer",
      "type": "Part-Time",
      "description": "Collaborate with product designers to implement pixel-perfect interfaces, conduct accessibility reviews, and ship thoughtful UI improvements. Expect to prototype interactions, refine microcopy, and partner with engineering to maintain design system components.",
      "location": "New York, NY",
      "salary": "Under $50K",
      "company": {
        "name": "PixelCraft",
        "description": "PixelCraft focuses on beautiful, accessible web products.",
        "contactEmail": "careers@pixelcraft.design",
        "contactPhone": "555-333-4444"
      }
    },
    {
      "id": "5",
      "title": "React Native Mobile Developer",
      "type": "Full-Time",
      "description": "Develop cross-platform mobile apps using React Native, integrating native modules where needed for performance and platform features. You will own feature development from design through release, work closely with QA on device testing, and optimize app startup and runtime performance.",
      "location": "Seattle, WA",
      "salary": "$100K - $125K",
      "company": {
        "name": "AppSpring",
        "description": "AppSpring delivers high-quality mobile applications for consumer brands.",
        "contactEmail": "jobs@appspring.com",
        "contactPhone": "555-444-5555"
      }
    },
    {
      "id": "6",
      "title": "Frontend Performance Engineer",
      "type": "Full-Time",
      "description": "Optimize web performance by measuring and improving Core Web Vitals (LCP, FID, CLS), reducing bundle sizes, and improving rendering paths. You will collaborate with product teams to prioritize performance work and introduce tooling for continuous measurement and regression prevention.",
      "location": "Remote",
      "salary": "$125K - $150K",
      "company": {
        "name": "SpeedyStack",
        "description": "SpeedyStack helps companies improve web performance at scale.",
        "contactEmail": "talent@speedystack.com",
        "contactPhone": "555-666-7777"
      }
    },
    {
      "id": "7",
      "title": "Accessibility Specialist",
      "type": "Part-Time",
      "description": "Audit web applications for accessibility issues, implement practical fixes, and provide guidance and training to engineering teams. This role involves running automated and manual audits, writing clear remediation plans, and advocating for inclusive design across product teams.",
      "location": "Chicago, IL",
      "salary": "$50K - $60K",
      "company": {
        "name": "Inclusive Web Co.",
        "description": "Consulting firm specializing in digital accessibility.",
        "contactEmail": "contact@inclusiveweb.co",
        "contactPhone": "555-777-8888"
      }
    },
    {
      "id": "8",
      "title": "Backend Engineer (Node.js)",
      "type": "Full-Time",
      "description": "Design and implement scalable backend services, create resilient database schemas, and build real-time APIs for internal and customer-facing products. You'll collaborate with front-end teams on API contracts, ensure observability, and help scale systems to handle increased load.",
      "location": "Boston, MA",
      "salary": "$125K - $150K",
      "company": {
        "name": "DataForge",
        "description": "DataForge builds analytics platforms for enterprises.",
        "contactEmail": "hr@dataforge.ai",
        "contactPhone": "555-888-9999"
      }
    },
    {
      "id": "9",
      "title": "DevOps Engineer",
      "type": "Full-Time",
      "description": "Manage CI/CD pipelines, infrastructure-as-code, and observability for cloud-native applications. You will own deployments, incident response playbooks, and work to automate repeatable tasks while improving system reliability and developer experience.",
      "location": "Remote",
      "salary": "$125K - $150K",
      "company": {
        "name": "InfraWorks",
        "description": "InfraWorks provides managed cloud infrastructure and DevOps services.",
        "contactEmail": "ops@infraworks.io",
        "contactPhone": "555-999-0000"
      }
    },
    {
      "id": "10",
      "title": "Product Manager",
      "type": "Full-Time",
      "description": "Drive product strategy and execution: define roadmaps, work closely with engineering and design to ship high-impact features, and communicate progress to stakeholders. You will use data and user research to prioritize work and ensure delivered features meet business and user needs.",
      "location": "Los Angeles, CA",
      "salary": "$125K - $150K",
      "company": {
        "name": "LaunchPad Co.",
        "description": "LaunchPad helps startups go from idea to scalable product.",
        "contactEmail": "pm-hiring@launchpad.co",
        "contactPhone": "555-000-1111"
      }
    }
  ]
}
